app/views/restaurants/_form.html.erb

SELECT "neighborhoods".* FROM "neighborhoods"
---
    <b><%= f.label :neighborhood %></b>
    <%= collection_select(:restaurant, :neighborhood_id, Neighborhood.all, :id, :name, {include_blank: true}) %>

SELECT "categories".* FROM "categories"
---
    <b><%= f.label :category %></b> <br>
    <%= collection_check_boxes(:restaurant, :category_ids, Category.all, :id, :name) %>