app/controllers/restaurants_controller.rb

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @restaurant = Restaurant.find_by_id(params[:id])

INSERT INTO "restaurants" ("name", "street", "city", "state", "country", "postal_code", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @restaurant = Restaurant.create(restaurant_params)

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @restaurant = Restaurant.find_by_id(params[:id])

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "restaurants" SET "neighborhood" = ?, "updated_at" = ? WHERE "restaurants"."id" = ?  [["neighborhood", "Heights"], ["updated_at", "2016-06-05 15:44:27.032009"], ["id", 1]]
---
  def update
    @restaurant = Restaurant.find_by_id(params[:id])

    @restaurant.update(restaurant_params)

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT 1  [["id", 5]]
DELETE FROM "restaurants" WHERE "restaurants"."id" = ?  [["id", 5]]
---
  def destroy
    @restaurant = Restaurant.find_by_id(params[:id])

    @restaurant.delete